In [1]:
#importing dataset
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

In [2]:
import os

In [3]:
os.chdir(r'C:\Users\ROHAN\Downloads')

In [4]:
df= pd.read_csv('rainfall_combined.csv')
df

,ID,UT,year,month,day,time,raingauges_id,name,ward_id,region,data
0,1,1.512227e+09,2017,12,2,15:05:00,1,BLUFF RES NO.3,66.0,Central,0.6
1,2,1.512227e+09,2017,12,2,15:10:00,1,BLUFF RES NO.3,66.0,Central,0.8
2,3,1.512228e+09,2017,12,2,15:15:00,1,BLUFF RES NO.3,66.0,Central,0.2
3,4,1.512228e+09,2017,12,2,15:20:00,1,BLUFF RES NO.3,66.0,Central,0.2
4,5,1.512252e+09,2017,12,2,22:00:00,1,BLUFF RES NO.3,66.0,Central,0.0
...,...,...,...,...,...,...,...,...,...,...,...
6744,80001,NaN,2017,12,2,22:00:00,43,not there,NaN,Northern,NaN
6745,80002,NaN,2017,12,3,22:00:00,43,not there,NaN,Northern,NaN
6746,80003,NaN,2017,12,4,22:00:00,43,not there,NaN,Northern,NaN
6747,80004,NaN,2017,12,5,22:00:00,43,not there,NaN,Northern,NaN
6748,80005,NaN,2017,12,6,22:00:00,43,not there,NaN,Northern,NaN

In [5]:
#check the null values
df.isnull().sum()

ID               0
UT               5
year             0
month            0
day              0
time             0
raingauges_id    0
name             0
ward_id          5
region           0
data             5
dtype: int64

In [6]:
#fill the null values using fillna
df.fillna(value=df['UT'].median(),inplace=True)
df.fillna(value=df['ward_id'].median(),inplace=True)
df.fillna(value=df['data'].median(),inplace=True)

In [7]:
df.isnull().sum()

ID               0
UT               0
year             0
month            0
day              0
time             0
raingauges_id    0
name             0
ward_id          0
region           0
data             0
dtype: int64

In [8]:
df['name'].unique()

array(['BLUFF RES NO.3', 'CHATSWORTH RES NO.1', 'CHATSWORTH RES NO.4',
       "CITY ENGINEER'S DEPT", 'CRABTREE S-P-S', 'DUNKELD RES',
       'FIRWOOD RES', 'ISLAND VIEW S-P-S', 'KENNEDY ROAD S-P-S',
       'RIDGE END RES', 'RIDGE VIEW RES', 'SAND PUMP HOPPER',
       'SHERWOOD RES NO.3', 'ST THOMAS RES', 'WENTWORTH RES',
       'WOODLAND RES NO.2', 'DBN NORTH HL RES', 'NEWLANDS RES NO.3',
       'PHOENIX RES NO.1', 'PHOENIX RES NO.4', 'BALLITO', 'HAZELMERE DAM',
       'UMHWWTW', 'CRAWFORD', 'UMH NTH', 'BUFFELS', 'CATO RIDGE',
       'ALVERSTN', 'INANDA DAM', 'WATERFALL', 'HILLCREST',
       'SHONGWENI DAM', 'PINETOWN', 'NAGLE DAM', 'RIVERLEA', 'KLOOF',
       'UMLAZI', 'UMBUMBULU RES', 'ISIPINGO RES', 'UMKDEPOT',
       'AMANZIMTOTI', 'not there'], dtype=object)

In [11]:
raingauge_counts = df.groupby('raingauges_id')['ID'].count()
print(raingauge_counts)

raingauges_id
1     151
2     210
3     169
4     180
5     200
6     172
7     170
8     207
9     157
10    176
11    165
12    164
13    194
14    184
15    113
16    224
17    201
18    159
19    200
20    165
21     14
22    189
23    127
24     89
25    166
26    152
27    151
28    167
29    156
30    219
31     19
32    201
33    202
34    158
35    155
36    122
37    124
38    136
41    266
42    202
43      5
44    168
Name: ID, dtype: int64

In [12]:
df.shape

(6749, 11)

In [13]:
df.iloc[-2]

ID                      80004
UT               1512518400.0
year                     2017
month                      12
day                         5
time                 22:00:00
raingauges_id              43
name                not there
ward_id          1512518400.0
region               Northern
data             1512518400.0
Name: 6747, dtype: object

In [14]:
 df.iloc[11]

ID                          334
UT                 1512394500.0
year                       2017
month                        12
day                           4
time                   13:35:00
raingauges_id                 1
name             BLUFF RES NO.3
ward_id                    66.0
region                  Central
data                        0.8
Name: 11, dtype: object

In [15]:
df['data'].mean()

1120550.3794339902

In [16]:
df['data'].median()

0.2

In [17]:
df['data'].describe()

count    6.749000e+03
mean     1.120550e+06
std      4.115638e+07
min      0.000000e+00
25%      2.000000e-01
50%      2.000000e-01
75%      4.000000e-01
max      1.512518e+09
Name: data, dtype: float64

In [18]:
df['region'].value_counts()

Central     2895
Western     1507
Northern    1429
Southern     918
Name: region, dtype: int64